[
    {
        "id":"1eka10c",
        "title":"Trump says he has 'no choice' but to support electric vehicles because Elon Musk 'endorsed me very strongly'",
        "score":3836,
        "num_comments":740,
        "created_utc":1722816653.0,
        "selftext":"",
        "url":"https:\/\/www.businessinsider.com\/trump-electric-vehicles-elon-musk-endorsement-2024-8"
    },
    {
        "id":"1i3tju5",
        "title":"Been waiting 8 years for this beauty and she’s finally mine! ",
        "score":3618,
        "num_comments":246,
        "created_utc":1737155534.0,
        "selftext":"Check out my brand new 2025 Volkswagen ID. Buzz with a blue two-tone exterior. It’s a first edition AWD with a 91kWh battery and 330 horsepower. And there’s lots of fun interior specs like a smart sunroof, 360 backup camera, and a large carplay screen. \n\nWhen they first announced the Buzz in 2016\/2017 I was immediately hooked! I was like yes that’s the coolest thing I’ve ever seen. So I went to the VW dealership where I had bought 3 cars prior, and begged for information. They or course had nothing to share. Since then I have been annoying my sales rep (sorry man!) and reading every article and update I could find about it. \n\nI found myself in need of a new car in 2022 and got an ID.4. It has been really fun diving into the EV world. I love the way the ID.4 drives and glides down the road. And all the tech gadgets are fun also! \n\nYesterday. Finally. I got the call from VW that there was a Buzz on the lot that I could come look at. I went down this morning and fell in love! \n\nThe ID. Buzz gives me all the warm nostalgic feelings but with new fancy features! It drives very smooth, just like the ID4. The battery has a huge capacity, there’s a ton of modular space on the inside, and it’s also very zippy! \n\nMy only complaint is the high step up to get inside. But I’m sure I’ll get used to that. \n\nI’m so stoked to finally have this amazing vehicle! Can’t wait to plan a trip and really test it out! \n",
        "url":"https:\/\/i.redd.it\/xl44yoeazmde1.jpeg"
    },
    {
        "id":"1j2ya99",
        "title":"The Volkswagen ID.4 surpasses the Tesla Model Y as the best-selling electric vehicle in Europe",
        "score":2583,
        "num_comments":284,
        "created_utc":1741048891.0,
        "selftext":"",
        "url":"https:\/\/en.softonic.com\/articles\/the-volkswagen-id-4-surpasses-the-tesla-model-y-as-the-best-selling-electric-vehicle-in-europe"
    },
    {
        "id":"l4yrke",
        "title":"President Biden will make entire 645k vehicle federal fleet electric",
        "score":2465,
        "num_comments":359,
        "created_utc":1611612103.0,
        "selftext":"",
        "url":"https:\/\/electrek.co\/2021\/01\/25\/president-biden-will-make-entire-645k-vehicle-federal-fleet-electric\/"
    },
    {
        "id":"1n44kra",
        "title":"Just picked up a new Xiaomi SU7 Max",
        "score":2319,
        "num_comments":271,
        "created_utc":1756567947.0,
        "selftext":"Ordered it in April 2025, was suppose to collect in October 2025 but there was a cancelled order with the exact same spec.\n\nCosting in total: 340K RMB \/\/ 48K USD\n\nIt is based on the SU7 Max 674 hp, but I added a 21 inch wheel customised.\n\nPicked up from the Beijing super factory. I’m a UK citizen living in China, so I had to rent a plate from someone.\n\nAnyway, my first electric vehicle. There was a lot of YU7s there too.\n\nSo far I’ve unlocked the autonomous driving and auto parking, works wonders.\n\n",
        "url":"https:\/\/www.reddit.com\/gallery\/1n44kra"
    },
    {
        "id":"1gwlgof",
        "title":"Automakers to Trump: Please Require Us to Sell Electric Vehicles",
        "score":2099,
        "num_comments":619,
        "created_utc":1732211465.0,
        "selftext":"",
        "url":"https:\/\/nytimes.com\/2024\/11\/21\/climate\/gm-ford-electric-vehicles-trump.html"
    },
    {
        "id":"1i686yk",
        "title":"Executive order signed to reverse US electric vehicle policies",
        "score":1842,
        "num_comments":790,
        "created_utc":1737426312.0,
        "selftext":"",
        "url":"https:\/\/www.theverge.com\/2025\/1\/20\/24347980\/trump-ev-order-carbon-emission-rule"
    },
    {
        "id":"1i1dugd",
        "title":"The Times Is Forced to Correct a Misleading Article Claiming Electric Vehicle Demand Is Falling When It’s Actually Rising",
        "score":1703,
        "num_comments":106,
        "created_utc":1736881973.0,
        "selftext":"https:\/\/bylinetimes.",
        "url":"https:\/\/bylinetimes.com\/2025\/01\/13\/the-times-was-forced-to-correct-a-misleading-article-claiming-electric-vehicle-demand-is-falling-when-its-actually-rising\/"
    },
    {
        "id":"1mnttpw",
        "title":"America Has Completely Blown Any Sort Of EV Transition",
        "score":1647,
        "num_comments":552,
        "created_utc":1754957714.0,
        "selftext":"Inside EVs editor-in-chief, Patrick George: \"the auto industry has always chased two things: efficiency and performance. And EVs trump gas cars at both. How long do you think the automakers that serve the U.S.—pretty much all of whom operate globally—will be willing to go along with archaic technology when the writing is on the wall everywhere else?\"\n\nAnd quoting Bloomberg:\n\"More than three-quarters of the value of vehicles brought into Nepal, Sri Lanka and Djibouti last year was purely electric. Import shares in Ethiopia and Laos were 40% and 30% respectively. Plug-in sales increased by 60% in developing countries as a whole in 2024, according to the International Energy Agency.\"",
        "url":"https:\/\/insideevs.com\/news\/768551\/america-ev-transition-cm\/"
    },
    {
        "id":"1kpan4b",
        "title":"I wish everyone had electric vehicles because I’m so tired of breathing in exhaust fumes",
        "score":1526,
        "num_comments":370,
        "created_utc":1747538862.0,
        "selftext":"I work at a drive thru and I’ll open the window and there is just a cloud of exhaust being sucked in towards my face it’s ridiculous. Like why is this even allowed?",
        "url":"https:\/\/www.reddit.com\/r\/electricvehicles\/comments\/1kpan4b\/i_wish_everyone_had_electric_vehicles_because_im\/"
    },
    {
        "id":"1k8eqfr",
        "title":"Trump is trashing electric vehicles. China is building cars the world wants. China dominates global EV sales, while U.S. consumers risk getting stuck on an island of outdated technology.",
        "score":1475,
        "num_comments":261,
        "created_utc":1745679122.0,
        "selftext":"",
        "url":"https:\/\/www.washingtonpost.com\/business\/2025\/04\/25\/auto-evs-trump-china-electric\/"
    },
    {
        "id":"1igu6gr",
        "title":"Canada announces plans for 25% tariff on electric vehicles coming from the US",
        "score":1452,
        "num_comments":185,
        "created_utc":1738602819.0,
        "selftext":"Looks like Canada will have to find alternate routes in importing Teslas from either Berlin or repeal the Chinese EV tax. Which means Tesla and BYD could resume their strategies in bringing their EVs back into Canada.",
        "url":"https:\/\/electrek.co\/2025\/02\/03\/canada-announces-plans-for-25-tariff-on-electric-vehicles-coming-from-the-us\/"
    },
    {
        "id":"os35hg",
        "title":"Toyota is quietly pushing Congress to slow the shift to electric vehicles",
        "score":1449,
        "num_comments":295,
        "created_utc":1627319233.0,
        "selftext":"",
        "url":"https:\/\/www.theverge.com\/2021\/7\/26\/22594235\/toyota-lobbying-dc-ev-congress-biden-donation"
    },
    {
        "id":"1lafu3m",
        "title":"Consumer Reports Urges U.S. Lawmakers to Drop Proposed Electric Vehicle Fees",
        "score":1410,
        "num_comments":228,
        "created_utc":1749821031.0,
        "selftext":"",
        "url":"https:\/\/evmagz.com\/consumer-reports-urges-u-s-lawmakers-to-drop-proposed-electric-vehicle-fees\/"
    },
    {
        "id":"152536h",
        "title":"As a conservative, I hated the idea of owning an electric car. And then this happened.",
        "score":1337,
        "num_comments":611,
        "created_utc":1689607671.0,
        "selftext":"Hey all.\n\nUntil last month I was ardently against EV ownership. \n\nI won’t go on about it too much but forcing people to buy only electric by a certain year sits in a sour spot with me. \n\nRead further below for how to better talk to someone like me. Many of us are willing to listen. \n\nWith that, last month my views on electric vehicles changed. A lot. \n\nI was at CarMax and as the agent was showing me options, I noticed a car in my price range that claimed to have CarPlay. \n\nI noticed it was an EV (2019 Nissan Leaf) and because there were only a few options for my budget with CarPlay I decided to test drive it. \n\nI instantly fell in love with everything about it. \n\nThe car is as quiet inside as many higher end Mercedes Benz models (measured by Car and Driver magazine)\n\nIt is relatively speedy off a stop, it turns well. \n\nAnd to top it all off, it costs 1\/4 the cost to run. Probably less because the regenerative braking means I likely won’t ever need a brake job over the time I own it. \n\nThe negative is that there was no CarPlay. They mislabeled the car in their inventory and I ended up negotiating a $200 price reduction and getting an external dash system for that. \n\nYet even after driving gasoline cars with CarPlay, I stuck with this little leaf. \n\nOnce I sat in it and drove it, felt no vibration from an engine, no shifting through the transmission, and how cold the AC gets so quickly (I’m in Vegas, this matters) I was hooked. \n\nNext up is something much better with larger range. This only has 150 mile range. Better credit, trade in, new EV? \n\nLikely yea. \n\nThere are things I don’t like. \n\nI am nearly over range anxiety. I haven’t driven it in the winter with the heat on and that bothers me to think of what the battery may do. \n\nBecause I’m in Nevada and we don’t have many intra state highways to begin with, long trips are nearly impossible, and since many of them are over steep grades, and the charging stations sometimes don’t work, I won’t even try them. \n\nSo my tune has changed. I’ll tell anyone to look in this direction. \n\nI’ll leave you with this if you’re trying to sell people like me on the idea:\n\nIt isn’t so much about the environment to people like me. \n\nI believe in global warming. I also watch billionaires scream about it and take private jets. \n\nYou’ll not win that position with many conservatives but we all feel the crunch of the economy, and this helps a great deal. \n\nWe all like nice stuff. If I knew how practically silent this thing was inside and how fun it was to drive, I would have actively looked at an EV as an option. \n\nIs this the future? Yes. \n\nDoes it need a better message for folks like me? 💯 yes. \n\nThanks all for reading.",
        "url":"https:\/\/www.reddit.com\/r\/electricvehicles\/comments\/152536h\/as_a_conservative_i_hated_the_idea_of_owning_an\/"
    },
    {
        "id":"xohw2u",
        "title":"My first EV - I've never had so many compliments on a car before !",
        "score":1333,
        "num_comments":203,
        "created_utc":1664195247.0,
        "selftext":"",
        "url":"https:\/\/i.redd.it\/5w7q9r0c57q91.jpg"
    },
    {
        "id":"1qclpq6",
        "title":"How long do electric car batteries last? Analysis of over 22,700 electric vehicles, covering 21 different vehicle models, confirms that overall, modern EV batteries are robust and built to last beyond a typical vehicle’s service life.",
        "score":1322,
        "num_comments":194,
        "created_utc":1768392779.0,
        "selftext":"",
        "url":"https:\/\/www.geotab.com\/blog\/ev-battery-health\/"
    },
    {
        "id":"166hs81",
        "title":"Biden-Harris Administration Announces $15.5 Billion to Support a Strong and Just Transition to Electric Vehicles, Retooling Existing Plants, and Rehiring Existing Workers",
        "score":1298,
        "num_comments":197,
        "created_utc":1693503992.0,
        "selftext":"",
        "url":"https:\/\/www.energy.gov\/articles\/biden-harris-administration-announces-155-billion-support-strong-and-just-transition"
    },
    {
        "id":"nswtuz",
        "title":"The fastest way to get more people to buy electric vehicles: Build more charging stations",
        "score":1261,
        "num_comments":354,
        "created_utc":1622903009.0,
        "selftext":"",
        "url":"https:\/\/www.vox.com\/22463219\/electric-vehicles-charging-station-infrastructure"
    },
    {
        "id":"1lgvu6r",
        "title":"Wanted to share my electric Ford E Transit work van",
        "score":1245,
        "num_comments":113,
        "created_utc":1750510289.0,
        "selftext":"I run a handyman business in the US Midwest and use a high roof Ford E Transit which I modified to fit my tool storage needs. My business is based on the premise that all of my customers are within 25miles of my shop location which has a level 2 charger onsite. Mileage range in the summer is about 135miles and closer to 100 miles in the winter, still plenty of range for at least 2-3 work locations a day, runs to the store for materials and the return drive to get it charged up for the next day. Currently I average about an extra $70 a month in electricity, compared to my previous gas powered vehicle that required around $120 in gas every two weeks. So far this setup has been perfect for my business, though I’ll admit it wouldn’t be very desirable if I didn’t have a charger at my shop. It was scary to make the initial investment into going fully electric but after owning the van for over a year now, the pros far exceed the cons for me. ",
        "url":"https:\/\/www.reddit.com\/gallery\/1lgvu6r"
    },
    {
        "id":"1jxbik3",
        "title":"Tesla Canada says its shady $43 million incentive grab was a misunderstanding",
        "score":1230,
        "num_comments":387,
        "created_utc":1744441512.0,
        "selftext":"\n\nTesla has sent a response to Transport Canada about its sudden incentive cash grab from March, stating that this is standard process and suggesting that the incentives were for backdated sales that Tesla hadn’t filed yet.\n\nUntil recently, Canada had a $5,000 incentive for electric vehicle purchases, similar to the US $7,500 federal incentive from Biden’s Inflation Reduction Act.\n\nThat ended earlier this year, though as the incentive program ran out of money more quickly than expected, and it didn’t look like the government was going to refill the program anytime soon. Canada is also currently going through a contentious federal election process, so it was unlikely for its government to move on refilling this incentive while things are shaken up.\n\nSo, the government communicated in January that the program would run out of money soon – very soon – giving dealers only a few days to claim incentives.\n\nThen in March, it was reported by the Toronto Star that something suspicious had happened with Tesla, as it had filed for 8,653 EV sales within the last 72 hours of the Canadian rebate incentive, an abnormally high number.\n\nOne Tesla locations in particular, Quebec City, claimed 4,000 rebates over the course of a weekend, which is physically impossible for a location of that size, and represents about a ~20x spike in daily deliveries for the location. Another location in Etobicoke reportedly claimed 2,528 rebates over the weekend, which is more than all the rebates that location had previously claimed combined.\n\nThe alarm was raised by the Canadian Auto Dealers Association, which said its dealers as a whole had been left out of around $10 million in rebates representing 2,295 cars. Dealerships claimed that “Tesla gamed the system” and that “they cleared everyone else out.”\n\n",
        "url":"https:\/\/electrek.co\/2025\/04\/09\/tesla-canada-says-its-shady-43-million-incentive-grab-was-a-misunderstanding\/"
    },
    {
        "id":"1g1vt91",
        "title":"Electric vehicle battery prices are expected to fall almost 50% by 2026",
        "score":1210,
        "num_comments":197,
        "created_utc":1728722392.0,
        "selftext":"",
        "url":"https:\/\/www.goldmansachs.com\/insights\/articles\/electric-vehicle-battery-prices-are-expected-to-fall-almost-50-percent-by-2025"
    },
    {
        "id":"1e6ynua",
        "title":"Trump Vows Action to End Electric Vehicle ‘Mandate’ on Day One",
        "score":1195,
        "num_comments":625,
        "created_utc":1721377243.0,
        "selftext":"",
        "url":"https:\/\/www.bloomberg.com\/news\/articles\/2024-07-19\/trump-vows-action-to-end-electric-vehicle-mandate-on-day-one"
    },
    {
        "id":"1q1srxr",
        "title":"Norway's new car sales were 96% electric in 2025",
        "score":1187,
        "num_comments":227,
        "created_utc":1767340398.0,
        "selftext":"",
        "url":"https:\/\/www.reuters.com\/sustainability\/climate-energy\/norways-new-car-sales-were-96-electric-2025-2026-01-02\/?taid=695778b1469db40001f63bd3&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter"
    },
    {
        "id":"1lnjmn9",
        "title":"Big Beautiful Bill is imposing a $250 fee on electric vehicles",
        "score":1179,
        "num_comments":303,
        "created_utc":1751216383.0,
        "selftext":"Looks like the Senate has doubled down and increased the fee to $250 and it’s back on the table.",
        "url":"https:\/\/www.congress.gov\/bill\/119th-congress\/house-bill\/1\/text"
    },
    {
        "id":"13r4skr",
        "title":"Bought a (very) cheap EV two weeks ago and it's completely changed my mind on EVs.",
        "score":1164,
        "num_comments":427,
        "created_utc":1684979999.0,
        "selftext":"As a car enthusiast, I have been watching EVs since I first heard about Tesla (back when they were still developing the original roadster). I was always put off by the usual issues (price, range, lack of infrastructure) and was convinced that it would be a long time before I owned an EV.\n\nMy favorite cars have been German hot hatches and performance sedans. I'm a \"save the manuals\" guy and love the sound of a V8. Some of my dream cars include classic cars, Lamborghinis, and Hellcats.\n\nRecently I came across a very inexpensive used Leaf while browsing things for sale. (cheap even by gen 1 Leaf standards) I immediately contacted the seller and bought it.\n\nEven with only \"90\" miles of range (according to the guess o meter), it's more than adequate for my daily needs around town and I can easily keep it charged on the level 1 charger that came with it.\n\nI love the way the electric powertrain feels. Even though the gen 1 leaf has a comparatively weak motor, it's plenty of zip in my daily city driving. (I almost never get on highways and the fastest roads are 45mph) As a gearhead, I underestimated how much I would enjoy the silence, smoothness, response, and torque of the electric powertrain. I also underestimated how much I enjoyed the efficiency of not sitting idling in traffic.\n\nWhen I bought it, I had no plans to sell my previous commuter car but in less than a week I changed my mind. I plan on keeping my old pickup truck because I haul things for my business and can also use it when I need to drive long distances. Because of this, the Leaf's range is more than adequate for me and my daily EV driving more than makes up for my use of a truck on my occasional long-distance trip.\n\nI'm sharing this hoping that other people reading this may also have their opinion swayed on electric cars. People who, like me, enjoy gasoline-powered cars and are unsure about EVs. I've already got my V8 truck-driving friend intrigued. I crunched the numbers for him and the difference in fuel cost between his truck and my leaf would pay for my leaf in less than a year.\n\nEdit: Thanks for all of the comments. I've made an effort to read every one so far. Here's some more info if you want some ammo to convince others. I know this info is out there but again it's one more bit of evidence to add to the pile. Plus I was curious and had already done the math.\n\nIn the two weeks I've owned my Leaf, I'm averaging 4.3 miles per kwh. Even at $0.15 per kwh, my Leaf costs about 3.5 cents per mile in electricity.\n\nMy 4 cylinder hatchback got an average of 24mpg which @$3.00\/gallon is 12.5 cents per mile.\n\nMy friend's V8 truck averages 15mpg which equates to 20 cents per mile.\n\nOver 100,000 miles, my Leaf costs $3,500 in electricity while my hatchback costs $12,500 and the truck costs $20,000.",
        "url":"https:\/\/www.reddit.com\/r\/electricvehicles\/comments\/13r4skr\/bought_a_very_cheap_ev_two_weeks_ago_and_its\/"
    },
    {
        "id":"145il74",
        "title":"Volvo Vows To Go All-Electric, Not Sell Another ICE Vehicle After 2030",
        "score":1159,
        "num_comments":206,
        "created_utc":1686349009.0,
        "selftext":"",
        "url":"https:\/\/www.carscoops.com\/2023\/06\/volvo-vows-to-go-all-electric-not-sell-another-ice-vehicle-after-2030\/"
    },
    {
        "id":"smt7nh",
        "title":"Electric Vehicles Are Getting Bigger and Heavier. Why? EVs don’t have to be massive. Smaller, more efficient cars would consume fewer resources and make roads a lot safer.",
        "score":1133,
        "num_comments":818,
        "created_utc":1644248685.0,
        "selftext":"",
        "url":"https:\/\/www.bloomberg.com\/opinion\/articles\/2022-02-07\/electric-vehicles-from-hummer-to-rivian-to-ford-are-getting-heavier-why?utm_source=facebook&cmpid=socialflow-facebook-view&utm_content=view&utm_campaign=socialflow-organic&utm_medium=social"
    },
    {
        "id":"v2oskk",
        "title":"Ford’s CEO says the global auto industry is headed for a huge price war in the coming years as electric vehicle costs drop and companies sell EVs priced around $25,000",
        "score":1126,
        "num_comments":357,
        "created_utc":1654110732.0,
        "selftext":"",
        "url":"https:\/\/abcnews.go.com\/US\/wireStory\/ford-ceo-sees-electric-vehicle-price-war-ev-85113648"
    },
    {
        "id":"11658xk",
        "title":"NSW introduces fines of up to $2,200 for \"ICEing\" electric vehicle charging stations",
        "score":1093,
        "num_comments":87,
        "created_utc":1676794705.0,
        "selftext":"",
        "url":"https:\/\/thedriven.io\/2023\/02\/17\/nsw-introduces-fines-of-up-to-2200-for-iceing-electric-vehicle-charging-stations\/"
    },
    {
        "id":"1ing4m7",
        "title":"Global Electric Vehicles sales surge 18% year-over-year in January",
        "score":1095,
        "num_comments":118,
        "created_utc":1739326039.0,
        "selftext":"",
        "url":"https:\/\/electrek.co\/2025\/02\/11\/global-ev-sales-surge-18-y-o-y-but-speed-bumps-lie-ahead\/"
    },
    {
        "id":"pte75i",
        "title":"Electrek: Toyota is facing boycotts over its fight to slow electric vehicle progress.",
        "score":1068,
        "num_comments":310,
        "created_utc":1632336543.0,
        "selftext":"",
        "url":"https:\/\/electrek.co\/2021\/09\/22\/toyota-facing-boycotts-over-fight-slow-electric-vehicle-progress\/"
    },
    {
        "id":"10b83fl",
        "title":"Take That, California! Wyoming Legislators Draft Resolution Banning Electric Vehicles By 2035",
        "score":1061,
        "num_comments":551,
        "created_utc":1673650198.0,
        "selftext":"",
        "url":"https:\/\/cowboystatedaily.com\/2023\/01\/13\/take-that-california-wyoming-legislators-draft-resolution-banning-electric-vehicles-by-2035\/"
    },
    {
        "id":"wpyoav",
        "title":"Dodge will discontinue its gas-powered Challenger and Charger muscle cars at the end of next year, as the brand transitions to electric vehicles.",
        "score":1041,
        "num_comments":269,
        "created_utc":1660667172.0,
        "selftext":"",
        "url":"https:\/\/www.cnbc.com\/2022\/08\/15\/dodge-challenger-charger-to-be-discontinued-in-2023.html"
    },
    {
        "id":"12hn48z",
        "title":"Five Years of Model 3 Ownership by the Numbers (I've tracked everything)",
        "score":1014,
        "num_comments":337,
        "created_utc":1681142498.0,
        "selftext":"It has been five years since we acquired a very early make of the Tesla Model 3 (LR RWD). Buckle up, data nerds, because I’ve tracked **EVERYTHING**.\n\n[Delivery Day \\(2018\\)](https:\/\/preview.redd.it\/9hjv6t9su2ta1.jpg?width=1747&format=pjpg&auto=webp&s=facb022de6851dd962727be02f0b7e484be0d08c)\n\n# Five Years of Model 3 Ownership by the Numbers\n\n**58,168** \\- Odometer reading - This works out 11,633 miles per year, under the average 13,500 miles per year driven by US drivers. I have a short commute.\n\n**14,115’** \\- Highest Elevation Driven - Pike’s Peak, Colorado. The battery charged from 42% to 52% on the way back down.\n\n**7385** \\- Sequence number of the car, aka the 7385th Model 3 built by Tesla. Approximately 1.9 million have been manufactured since making this car older than 99.6% of Model 3’s you see on the road.\n\n**2,805 mi** \\- Longest Road Trip - Ohio to Colorado Springs and back in the summer of 2020.\n\n[Lifetime Drive Map](https:\/\/preview.redd.it\/9j53zpxxu2ta1.jpg?width=2048&format=pjpg&auto=webp&s=85b154aa9d138f05ee80131bd568622e6c10dd8e)\n\n**261** \\- Watt-hours per mile consumed - this is the average efficiency of the car throughout its lifetime.  A single gallon of gasoline contains 33,700 watt-hours of energy. This means 261 Wh\/mi is the same as 129 mpg (33,700\/261).  Thanks for the correction, commenters. I somehow messed up the math in the original post.\n\n**94%** \\- Percentage of charges that took place at home.\n\n**74** \\- Software updates (since I started counting in Jan 2019 - so there were more). Software updates download via the internet, just as they do to your cell phone. Some features added over the years that the car didn’t come with include: The ability to change lanes automatically on the highway and autonomously take highway exits, the ability to drive autonomously in a parking lot and pick me up at the door, Spotify, Netflix, video games, and a fart machine.\n\n**30 min** \\- Average length of each charging stop on road trips. The majority of these charges were while we ate lunch or dinner. In fact, all the meal stops likely brought up the average since we would often stay longer than necessary eating. The necessary amount of time to stop is usually closer to 20 minutes.\n\n**$27** \\- Average additional cost of electricity to our monthly power bill incurred by the car.\n\n**13.5** \\- Megawatt Hours Consumed - Total energy consumed by the car. This is enough electricity to power the average home in Ohio for 1.25 years.\n\n**5** \\- Service Center Visits - Total cost $885 (a windshield - everything else warranty\/recall).\n\n**3** \\- Mobile Service Visits to my home - Total cost $216 (to repair a torn underbody shield).\n\n**3** \\- Windshields replaced - rear window spontaneously cracked (replaced under warranty in 2018), front windshield cracked out during a failed Safelite rock chip fix in 2019, [front windshield destroyed by a snowplow in 2022](https:\/\/youtu.be\/WzQqbbxbuLw) (fixed for free courtesy of ODOT).\n\n[RIP Windshield #2](https:\/\/preview.redd.it\/ha3k04qnx2ta1.png?width=1276&format=png&auto=webp&s=2708a6b54661c3aabadc99570cd1310cf7838814)\n\n**3** \\- Sets of tires. I admittedly blew through my stock set of all seasons by 20k miles. I've been much more kind to my tires since. I'm currently swapping between a summer set and a winter set, and both have 1-2 seasons of life on them.\n\n**3** \\- Test drives given to complete strangers - In the early days, Tesla was not making inventory vehicles. Every Model 3 was delivered to a customer, so you couldn’t drive one unless you bought one. Three people found me in various ways and test-drove my car before they purchased one for themselves.\n\n**1** \\- Number of times we couldn’t go someplace because we were in an electric car. Wanted to visit Great Sand Dunes National Park while staying in Colorado Springs. The car had to charge on the way back, but the charger was so out of the way that it would have added hours of drive time. We did something closer instead.\n\n**0.3%** \\- Lowest useable battery capacity reached - First Thanksgiving with the car. I had calculated we could make all the family visits we needed to get to that day on one charge but didn’t realize the car loses 3% of its battery capacity every time it’s parked in sub-zero temperatures. Still unsure why. It must have something to do with keeping the battery warm.\n\n**0** \\- Number of times the battery died before reaching a charger. The example above was the only close call.\n\n**0** \\- Number of brake services and oil changes\n\n**0** \\- Number of times Autopilot crashed the car",
        "url":"https:\/\/www.reddit.com\/r\/electricvehicles\/comments\/12hn48z\/five_years_of_model_3_ownership_by_the_numbers\/"
    },
    {
        "id":"12fot11",
        "title":"E.P.A. Is Said to Propose Rules Meant to Drive Up Electric Car Sales Tenfold | In what would be the nation’s most ambitious climate regulation, the proposal is designed to ensure that electric cars make up the majority of new U.S. auto sales by 2032.",
        "score":1011,
        "num_comments":445,
        "created_utc":1680966426.0,
        "selftext":"",
        "url":"https:\/\/www.nytimes.com\/2023\/04\/08\/climate\/biden-electric-cars-epa.html?unlocked_article_code=sWRar9oD5hbtFYEvmDrv6VRd_-aVFAuB_tb-6BcwWBaqjuEJmOBxWMw5o_fCQxbFkuF_0_kdyZ9OMtvuR4TQ1x753QQxsypJ9oK8uttmIrugCObTrQAX9CKZhZ6u_b0xRckTdRAIZk8vDEIR2jAvaK78YQjRAsxgeCnj9un65Zqj1dSL-ZPE89-PiVygL27lyW07R4VhOGngWQ64xR9YZOfUT9LGq-307Xl3uuDX3Wc75lZBywynbE4h8SSlgmU-Lo09tv_5RBmHJMibU1qS2hbS1xWWeHKv6J-OLvQUzlFievutw_pmBoSLcwXFLoHwqrFfpA9i2JSTWE6oAa479Ic"
    },
    {
        "id":"1ev7vyz",
        "title":"EVs are starting to overtake gas-powered cars in a surprising place (Ethiopia)",
        "score":989,
        "num_comments":94,
        "created_utc":1723983503.0,
        "selftext":"\"There are around 100,000 EVs in Ethiopia so far. The Ethiopian government estimates that number will more than quadruple by 2032. That’s largely because the national government took the extraordinary step earlier this year of banning the import of all gas-powered passenger vehicles — becoming the first nation in the world to do so.\"\n\n\"Ethiopia is leaning hard into EVs in part because importing fuel is expensive, and 96% of the country’s electricity comes from clean hydropower – a dual win for the country’s finances and the environment.\"",
        "url":"https:\/\/amp.cnn.com\/cnn\/2024\/08\/17\/climate\/ethiopia-evs-gas-car-ban-climate"
    },
    {
        "id":"1chn6ut",
        "title":"Kia U.S. EV Sales Hit A New Record In April 2024 | For the first time in history, the company sold roughly 5,000 all-electric cars in a single month.",
        "score":980,
        "num_comments":295,
        "created_utc":1714572745.0,
        "selftext":"",
        "url":"https:\/\/insideevs.com\/news\/718103\/kia-us-ev-sales-april2024\/"
    },
    {
        "id":"q45l49",
        "title":"Michelin is developing airless tires for electric vehicles, set to release in 2024",
        "score":973,
        "num_comments":226,
        "created_utc":1633723306.0,
        "selftext":"",
        "url":"https:\/\/i.imgur.com\/dGXnn0H.jpeg"
    },
    {
        "id":"yecs81",
        "title":"The Chevy Bolt's huge sales prove America is craving a cheap electric car | CNN Business",
        "score":969,
        "num_comments":325,
        "created_utc":1666828265.0,
        "selftext":"",
        "url":"https:\/\/www.cnn.com\/2022\/10\/26\/business\/chevrolet-bolt-sales?fbclid=IwAR00sPk-MbnPoWQRNqOI6ZdPsDH61wwKK74LQmF-bZoBB9nRjRQpenEKF-E"
    },
    {
        "id":"1qo5tal",
        "title":"Fully electric vehicle sales in EU overtake petrol for first time in December",
        "score":945,
        "num_comments":79,
        "created_utc":1769494102.0,
        "selftext":"",
        "url":"https:\/\/www.reuters.com\/business\/autos-transportation\/fully-electric-vehicle-sales-eu-overtake-petrol-first-time-december-2026-01-27\/"
    },
    {
        "id":"vliorq",
        "title":"Electric vehicles should be cheaper to buy on average than combustion vehicles in about five years, without subsidies!",
        "score":946,
        "num_comments":249,
        "created_utc":1656290290.0,
        "selftext":"",
        "url":"https:\/\/about.bnef.com\/blog\/the-ev-price-gap-narrows\/"
    },
    {
        "id":"vy5vv4",
        "title":"Polestar reports 125% increase in electric car sales, becomes a quiet success in EV space",
        "score":929,
        "num_comments":183,
        "created_utc":1657725938.0,
        "selftext":"",
        "url":"https:\/\/electrek.co\/2022\/07\/13\/polestar-reports-125-increase-electric-car-sales-quiet-success-ev-space\/"
    },
    {
        "id":"1izuy21",
        "title":"Volkswagen ID.4 sales soar by 653% in the United States: what has happened? The Volkswagen ID.4 experiences a significant increase in sales in January 2025, becoming the third best-selling electric vehicle in the U.S. market",
        "score":923,
        "num_comments":175,
        "created_utc":1740702457.0,
        "selftext":"",
        "url":"https:\/\/en.softonic.com\/articles\/volkswagen-id-4-sales-soar-by-653-in-the-united-states-what-has-happened"
    },
    {
        "id":"vc5y5n",
        "title":"Ford Halts Mustang Mach-E Sales: Safety Recall With No Current Fix | Ford has instructed dealers not to demonstrate or deliver any new in-stock vehicles involved in the recall.",
        "score":910,
        "num_comments":297,
        "created_utc":1655220212.0,
        "selftext":"",
        "url":"https:\/\/insideevs.com\/news\/592075\/ford-mustang-mache-safety-recall-stop-sale\/"
    },
    {
        "id":"ugzurb",
        "title":"Biden kicks off $3 billion plan to boost battery production for electric vehicles",
        "score":903,
        "num_comments":155,
        "created_utc":1651525934.0,
        "selftext":"",
        "url":"https:\/\/www.cnbc.com\/2022\/05\/02\/biden-starts-3-billion-plan-to-boost-battery-production-for-evs.html"
    },
    {
        "id":"1nde1zy",
        "title":"Ottawa considering scrapping tariffs on Chinese electric vehicles",
        "score":904,
        "num_comments":194,
        "created_utc":1757510473.0,
        "selftext":"",
        "url":"https:\/\/www.ctvnews.ca\/business\/autos\/article\/ottawa-considering-scrapping-tariffs-on-chinese-electric-vehicle-tariffs\/"
    },
    {
        "id":"12pbyre",
        "title":"Major drop in lithium prices could mean cheaper electric vehicles",
        "score":894,
        "num_comments":166,
        "created_utc":1681729599.0,
        "selftext":"",
        "url":"https:\/\/www.cbc.ca\/news\/canada\/sudbury\/lithium-price-drop-electric-vehicles-1.6811105"
    },
    {
        "id":"1fhqjgz",
        "title":"“What if the electricity goes out?”",
        "score":874,
        "num_comments":592,
        "created_utc":1726443344.0,
        "selftext":"Sick of hearing this one. I always respond with:\n\n\"But you wouldn't be able to get gas, either.\" \n\n\"Well I would have gas!\"\n\n\"Well, my car would be charged!\"\n\n\"Oh.\"\n\nDo people think the grid needs to be up in order for them to use an electric vehicle? Like it would suddenly stop driving if power went out because it has no reserve capacity?\n\nUgh. Just venting.",
        "url":"https:\/\/www.reddit.com\/r\/electricvehicles\/comments\/1fhqjgz\/what_if_the_electricity_goes_out\/"
    },
    {
        "id":"mmtrre",
        "title":"Transportation Secretary Pete Buttigieg: Electric vehicles shouldn't be a luxury item",
        "score":868,
        "num_comments":263,
        "created_utc":1617894288.0,
        "selftext":"",
        "url":"https:\/\/finance.yahoo.com\/news\/transportation-secretary-pete-buttigieg-electric-vehicles-shouldnt-be-a-luxury-item-145007623.html"
    }
]